'use strict'
// задача 2

const rain = rain;// с помощью Math.Random и Math.round напишите выражение, которое будет возвращать 1 или 0 я не понимаю как ее сюда применить обьясните пожалуйста

if (rain = 1) {
    alert('Пошел дождь.Возьмите зонт')
} else if (rain = 0) {
    alert('Дождя нет!')
}


//3 задача

let russkii = +prompt('Введите кол-во баллов по русскому языку: ');

let matematika = +prompt('Введите кол-во баллов по русскому языку: ');

let informatika = +prompt('Введите кол-во баллов по информатики: ');

if ((russkii + matematika + informatika) >= 265) {
    alert('Поздравляю, ты поступил на бюджет!')
} else {
    alert('Сорян но у тебя не получилось')
}


//задача 4


//мне кажется чего то не хватает

let cash = +prompt('Сколько денег вы хотите снять')
if(cash >= 100) {
    alert('заберай бабки')
} else if(cash <= 100) {
    console.log('Минимальная выдача 100 рублей');
}
